Ran Plan for project: `terraform-module-proxmox-container` dir: `repositories/terraform-module-proxmox-container` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # github_repository_file.config_terraform_docs[0] will be created
+ resource "github_repository_file" "config_terraform_docs" {
      + branch              = "main"
      + commit_author       = "Terraform"
      + commit_email        = "terraform-github@simonweald.com"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            formatter: markdown table
            output:
              file: README.md
            settings:
              anchor: false
              default: false
              escape: false
              hide-empty: true
            sort:
              enabled: true
              by: required
        EOT
      + file                = ".terraform-docs.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "terraform-module-proxmox-container"
      + sha                 = (known after apply)
    }

  # github_repository_file.workflow_terraform_docs_validate[0] will be created
+ resource "github_repository_file" "workflow_terraform_docs_validate" {
      + branch              = "main"
      + commit_author       = "Terraform"
      + commit_email        = "terraform-github@simonweald.com"
      + commit_message      = "Managed by Terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            name: "ensure terraform module docs are up to date"
            on:
              pull_request:
                # The specific activity types are listed here to include "labeled" and "unlabeled"
                # (which are not included by default for the "pull_request" trigger).
                # This is needed to allow skipping enforcement of the changelog in PRs with specific labels,
                # as defined in the (optional) "skipLabels" property.
                types: [opened, synchronize, reopened, ready_for_review, labeled, unlabeled]
            
            jobs:
              changelog:
                runs-on: ubuntu-latest
                steps:
                - uses: actions/checkout@v3
                  with:
                    ref: ${{ github.event.pull_request.head.ref }}
                - name: Render terraform docs and push changes back to PR
                  uses: terraform-docs/gh-actions@main
                  with:
                    args: "--output-check=true"
                    config-file: .terraform-docs.yml
                    working-dir: .
        EOT
      + file                = ".github/workflows/terraform-docs-validate.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "terraform-module-proxmox-container"
      + sha                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-module-proxmox-container`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.lab.analbeard.com/lock?id=a7d-corp%252Fgithub-repo-management%252Frepositories%252Fterraform-module-proxmox-container%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-module-proxmox-container`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`